IDEA Open Model
ConcreteMemberDataEc2 Class
Compatible with IDEA StatiCa 20.1
 Concrete member data Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenAttribute
 IdeaRS.OpenModel.Concrete.ConcreteMemberData
 IdeaRS.OpenModel.Concrete.ConcreteMemberDataEc2
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ConcreteMemberDataEc2 : ConcreteMemberData
Public Class ConcreteMemberDataEc2
	Inherits ConcreteMemberData
The ConcreteMemberDataEc2 type exposes the following members.
Constructors
Name | Description
ConcreteMemberDataEc2
 Constructor
Top
Properties
Name | Description
BeamData
 Beam data
CalculationSetup
 Calculation setup
 (Inherited from ConcreteMemberData.)
CoeffKxForWmax
 coefficient kx to increase limited concrete crack - only Dutch NAD
ColumnData
 Column data
CreepCoeffInfinity
 Gets or sets the user defined creep coefficient in infinity. If null, then we calculate them.
CreepCoeffInfinityValue
 type of creep coefficient
DeflectionRequirement
 gets or set deflection requirement for deflection calculation
Element
 Element for attribute
 (Inherited from OpenAttribute.)
ExposureClassesData
 Exposure classes
MemberImportance
 Gets or sets the member importance.
MemberType
 Gets or sets the structural type of member.
 (Inherited from ConcreteMemberData.)
RelativeHumidity
 Gets or sets the surrounding relative humidity.
TimeAxis
 Time axis
 (Inherited from ConcreteMemberData.)
TwoWaySlabType
 two way slab type
 (Inherited from ConcreteMemberData.)
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace